const infos = [
    {
        number: 1,
        main: ["عَنْ أَمِيرِ المُؤمِنينَ أَبي حَفْصٍ عُمَرَ بْنِ الخَطَّابِ رَضيَ اللهُ تعالى عنْهُ قَالَ: سَمِعْتُ رَسُولَ اللهِ يَقُولُ: إِنَّمَا الأَعْمَالُ بِالنِّيَّاتِ، وَإِنَّمَا لِكُلِّ امْرِئٍ مَا نَوَى، فَمَنْ كَانَتْ هِجْرَتُهُ إِلى اللهِ وَرَسُوله فَهِجْرَتُهُ إلى اللهِ وَرَسُوله، وَمَنْ كَانَتْ هِجْرَتُهُ لِدُنْيَا يُصِيْبُهَا، أَو امْرأَة يَنْكِحُهَا، فَهِجْرَتُهُ إِلى مَا هَاجَرَ إِلَيْهِ."
               , 
               "رواه إماما المحدثين أبو عبد الله محمد بن إسماعيل بن إبراهيم بن المغيرة بن بَرْدِزْبَهْ البخاري، وأبو الحسين مسلم بن الحجَّاج بن مسلم القشيري النيسابوري، في صحيحيهما اللَذين هما أصح الكتب المصنفة."],
        details: "تفاصيل إضافية للمعلومة الأولى."
    },
    {
        number: 2,
        main: ["هذا هو الفقرة الأولى للمعلومة الثانية.", "هذا هو الفقرة الثانية للمعلومة الثانية."],
        details: "تفاصيل إضافية للمعلومة الثانية."
    },
    {
        number: 3,
        main: ["هذا هو الفقرة الأولى للمعلومة .", "هذا هو الفقرة الثانية للمعلومة ."],
        details: "تفاصيل إضافية للمعلومة الثانية."
    },
    {
        number: 4,
        main: ["fffffffff الثانية."
               ,
              "هذا هو الفقرة الثانية للمعلومة الثانية."
              ],
        details: "تفاصيل إضافية للمعلومة الثانية."
    },
    {
        number: 5,
        main: ["هذا هو الفقرة الأولى للمعلومة الثانية.", "هذا هو الفقرة الثانية للمعلومة الثانية."],
        details: "تفاصيل إضافية للمعلومة الثانية."
    },
    {
        number: 6,
        main: ["هذا هو الفقرة الأولى للمعلومة الثانية.", "هذا هو الفقرة الثانية للمعلومة ."],
        details: "تفاصيل إضافية للمعلومة الثانية."
    },
    {
        number: 7,
        main: ["هذا هو الفقرة الأولى للمعلومة الثانية.", "هذا هو الفقرة الثانية للمعلومة الثانية."],
        details: "تفاصيل إضافية للمعلومة الثانية."
    },
    {
        number: 8,
        main: ["هذا هو الفقرة الأولى ."
               ,
               "هذا هو الفقرة الثانية للمعلومة الثانية."],
        details: "تفاصيل إضافية للمعلومة الثانية."
    },
    {
        number: 9,
        main: ["هذا هو الفقرة الأولى للمعلومة الثانية.", "هذا هو الفقرة الثانية للمعلومة الثانية."],
        details: "تفاصيل إضافية للمعلومة الثانية."
    },
    {
        number: 10,
        main: ["هذا هو الفقرة الأولى للمعلومة الثانية.", "هذا هو الفقرة الثانية للمعلومة الثانية."],
        details: "تفاصيل إضافية للمعلومة الثانية."
    },
    {
        number: 11,
        main: ["هذا هو الفقرة الأولى للمعلومة الثانية.", "هذا هو الفقرة الثانية للمعلومة الثانية."],
        details: "تفاصيل إضافية للمعلومة الثانية."
    },
    {
        number: 12,
        main: ["هذا هو الفقرة الأولى للمعلومة الثانية.", "هذا هو الفقرة الثانية للمعلومة الثانية."],
        details: "تفاصيل إضافية للمعلومة الثانية."
    },
    {
        number: 13,
        main: ["هذا هو الفقرة الأولى للمعلومة الثانية.", "هذا هو الفقرة الثانية للمعلومة الثانية."],
        details: "تفاصيل إضافية للمعلومة الثانية."
    }
    // Füge weitere Fakten hinzu, bis zu 40
];
