const infos = [
    {
        number: 1,
        main: [
            {
                text: "عَنْ أَمِيرِ المُؤمِنينَ أَبي حَفْصٍ عُمَرَ بْنِ الخَطَّابِ رَضيَ اللهُ تعالى عنْهُ قَالَ: سَمِعْتُ رَسُولَ اللهِ يَقُولُ: إِنَّمَا الأَعْمَالُ بِالنِّيَّاتِ، وَإِنَّمَا لِكُلِّ امْرِئٍ مَا نَوَى، فَمَنْ كَانَتْ هِجْرَتُهُ إِلى اللهِ وَرَسُوله فَهِجْرَتُهُ إلى اللهِ وَرَسُوله، وَمَنْ كَانَتْ هِجْرَتُهُ لِدُنْيَا يُصِيْبُهَا، أَو امْرأَة يَنْكِحُهَا، فَهِجْرَتُهُ إِلى مَا هَاجَرَ إِلَيْهِ.",
                style: { fontSize: "22px", color: "green" }
            },
            {
                text: "رواه إماما المحدثين أبو عبد الله محمد بن إسماعيل بن إبراهيم بن المغيرة بن بَرْدِزْبَهْ البخاري، وأبو الحسين مسلم بن الحجَّاج بن مسلم القشيري النيسابوري، في صحيحيهما اللَذين هما أصح الكتب المصنفة.",
                style: { fontSize: "16px", color: "blue" }
            }
        ],
        details: "هذه تفاصيل إضافية عن المعلومة الأولى."
    },
    {
        number: 2,
        main: [
            {
                text: "هذا هو الفقرة الأولى من المعلومة الثانية.",

                style: { fontSize: "20px", color: "green" }
            },
            {
                text: "رواه مسلم.",
                style: { fontSize: "16px", color: "purple" }
            }
        ],
        details: "هذه تفاصيل إضافية عن المعلومة الثانية."
    },
    {
        number: 3,
        main: [
            {
                text: "عَنْ أَبِيْ عَبْدِ الرَّحْمَنِ عَبْدِ اللهِ بْنِ عُمَرَ بْن الخَطَّابِ رَضِيَ اللهُ عَنْهُمَا قَالَ: سَمِعْتُ النبي صلى الله عليه وسلم يَقُوْلُ: (بُنِيَ الإِسْلامُ عَلَى خَمْسٍ: شَهَادَةِ أَنْ لاَ إِلَهَ إِلاَّ الله وَأَنَّ مُحَمَّدَاً رَسُوْلُ اللهِ، وَإِقَامِ الصَّلاةِ، وَإِيْتَاءِ الزَّكَاةِ، وَحَجِّ البِيْتِ، وَصَوْمِ رَمَضَانَ.",
                style: { fontSize: "20px", color: "green" }
            },
            {
                text: "رواه البخاري ومسلم.",
                style: { fontSize: "16px", color: "purple" }
            }
        ],
        details: "هذه تفاصيل إضافية عن المعلومة الثانية."
    },
    {
        number: 4,
        main: [
            {
                text: "عَنْ عَبْدِ اللهِ بنِ مَسْعُوْدْ رَضِيَ اللهُ عَنْهُ قَالَ: حَدَّثَنَا رَسُوْلُ اللهِ صلى الله عليه وسلم وَهُوَ الصَّادِقُ المَصْدُوْقُ: (إِنَّ أَحَدَكُمْ يُجْمَعُ خَلْقُهُ فِيْ بَطْنِ أُمِّهِ أَرْبَعِيْنَ يَوْمَاً نُطْفَةً، ثُمَّ يَكُوْنُ عَلَقَةً مِثْلَ ذَلِكَ، ثُمَّ يَكُوْنُ مُضْغَةً مِثْلَ ذَلِكَ، ثُمَّ يُرْسَلُ إِلَيْهِ المَلَكُ فَيَنفُخُ فِيْهِ الرٌّوْحَ، وَيَؤْمَرُ بِأَرْبَعِ كَلِمَاتٍ: بِكَتْبِ رِزْقِهِ وَأَجَلِهِ وَعَمَلِهِ وَشَقِيٌّ أَوْ سَعِيْدٌ. فَوَالله الَّذِي لاَ إِلَهَ غَيْرُهُ إِنََّ أَحَدَكُمْ لَيَعْمَلُ بِعَمَلِ أَهْلِ الجَنَّةِ حَتَّى مَا يَكُوْنُ بَيْنَهُ وَبَيْنَهَا إلاذِرَاعٌ فَيَسْبِقُ عَلَيْهِ الكِتَابُ فَيَعْمَلُ بِعَمَلِ أَهْلِ النَّارِ فَيَدْخُلُهَا، وَإِنَّ أَحَدَكُمْ لَيَعْمَلُ بِعَمَلِ أَهْلِ النَّارِ حَتَّى مَايَكُونُ بَيْنَهُ وَبَيْنَهَا إلا ذِرَاعٌ فَيَسْبِقُ عَلَيْهِ الكِتَابُ فَيَعْمَلُ بِعَمَلِ أَهْلِ الجَنَّةِ فَيَدْخُلُهَا.",
                style: { fontSize: "20px", color: "green" }
            },
            {
                text: "هذا هو الفقرة الثانية من المعلومة الثانية.",
                style: { fontSize: "16px", color: "purple" }
            }
        ],
        details: "هذه تفاصيل إضافية عن المعلومة الثانية."
    },
    {
        number: 5,
        main: [
            {
                text: "هذا هو الفقرة الأولى من المعلومة الثانية.",
                style: { fontSize: "20px", color: "green" }
            },
            {
                text: "هذا هو الفقرة الثانية من المعلومة الثانية.",
                style: { fontSize: "16px", color: "purple" }
            }
        ],
        details: "هذه تفاصيل إضافية عن المعلومة الثانية."
    },
    {
        number: 6,
        main: [
            {
                text: "هذا هو الفقرة الأولى من المعلومة الثانية.",
                style: { fontSize: "20px", color: "green" }
            },
            {
                text: "هذا هو الفقرة الثانية من المعلومة الثانية.",
                style: { fontSize: "16px", color: "purple" }
            }
        ],
        details: "هذه تفاصيل إضافية عن المعلومة الثانية."
    },
    {
        number: 7,
        main: [
            {
                text: "هذا هو الفقرة الأولى من المعلومة الثانية.",
                style: { fontSize: "20px", color: "green" }
            },
            {
                text: "هذا هو الفقرة الثانية من المعلومة الثانية.",
                style: { fontSize: "16px", color: "purple" }
            }
        ],
        details: "هذه تفاصيل إضافية عن المعلومة الثانية."
    },
    {
        number: 8,
        main: [
            {
                text: "هذا هو الفقرة الأولى من المعلومة الثانية.",
                style: { fontSize: "20px", color: "green" }
            },
            {
                text: "هذا هو الفقرة الثانية من المعلومة الثانية.",
                style: { fontSize: "16px", color: "purple" }
            }
        ],
        details: "هذه تفاصيل إضافية عن المعلومة الثانية."
    },
    {
        number: 9,
        main: [
            {
                text: "هذا هو الفقرة الأولى من المعلومة الثانية.",
                style: { fontSize: "20px", color: "green" }
            },
            {
                text: "هذا هو الفقرة الثانية من المعلومة الثانية.",
                style: { fontSize: "16px", color: "purple" }
            }
        ],
        details: "هذه تفاصيل إضافية عن المعلومة الثانية."
    },
    {
        number: 10,
        main: [
            {
                text: "هذا هو الفقرة الأولى من المعلومة الثانية.",
                style: { fontSize: "20px", color: "green" }
            },
            {
                text: "هذا هو الفقرة الثانية من المعلومة الثانية.",
                style: { fontSize: "16px", color: "purple" }
            }
        ],
        details: "هذه تفاصيل إضافية عن المعلومة الثانية."
    },
    {
        number: 11,
        main: [
            {
                text: "هذا هو الفقرة الأولى من المعلومة الثانية.",
                style: { fontSize: "20px", color: "green" }
            },
            {
                text: "هذا هو الفقرة الثانية من المعلومة الثانية.",
                style: { fontSize: "16px", color: "purple" }
            }
        ],
        details: "هذه تفاصيل إضافية عن المعلومة الثانية."
    },
    {
        number: 12,
        main: [
            {
                text: "هذا هو الفقرة الأولى من المعلومة الثانية.",
                style: { fontSize: "20px", color: "green" }
            },
            {
                text: "هذا هو الفقرة الثانية من المعلومة الثانية.",
                style: { fontSize: "16px", color: "purple" }
            }
        ],
        details: "هذه تفاصيل إضافية عن المعلومة الثانية."
    },
    {
        number: 13,
        main: [
            {
                text: "هذا هو الفقرة الأولى من المعلومة الثانية.",
                style: { fontSize: "20px", color: "green" }
            },
            {
                text: "هذا هو الفقرة الثانية من المعلومة الثانية.",
                style: { fontSize: "16px", color: "purple" }
            }
        ],
        details: "هذه تفاصيل إضافية عن المعلومة الثانية."
    },
    {
        number: 14,
        main: [
            {
                text: "هذا هو الفقرة الأولى من المعلومة الثانية.",
                style: { fontSize: "20px", color: "green" }
            },
            {
                text: "هذا هو الفقرة الثانية من المعلومة الثانية.",
                style: { fontSize: "16px", color: "purple" }
            }
        ],
        details: "هذه تفاصيل إضافية عن المعلومة الثانية."
    },
    {
        number: 15,
        main: [
            {
                text: "هذا هو الفقرة الأولى من المعلومة الثانية.",
                style: { fontSize: "20px", color: "green" }
            },
            {
                text: "هذا هو الفقرة الثانية من المعلومة الثانية.",
                style: { fontSize: "16px", color: "purple" }
            }
        ],
        details: "هذه تفاصيل إضافية عن المعلومة الثانية."
    },
    {
        number: 16,
        main: [
            {
                text: "هذا هو الفقرة الأولى من المعلومة الثانية.",
                style: { fontSize: "20px", color: "green" }
            },
            {
                text: "هذا هو الفقرة الثانية من المعلومة الثانية.",
                style: { fontSize: "16px", color: "purple" }
            }
        ],
        details: "هذه تفاصيل إضافية عن المعلومة الثانية."
    },
    {
        number: 17,
        main: [
            {
                text: "هذا هو الفقرة الأولى من المعلومة الثانية.",
                style: { fontSize: "20px", color: "green" }
            },
            {
                text: "هذا هو الفقرة الثانية من المعلومة الثانية.",
                style: { fontSize: "16px", color: "purple" }
            }
        ],
        details: "هذه تفاصيل إضافية عن المعلومة الثانية."
    },
    {
        number: 18,
        main: [
            {
                text: "هذا هو الفقرة الأولى من المعلومة الثانية.",
                style: { fontSize: "20px", color: "green" }
            },
            {
                text: "هذا هو الفقرة الثانية من المعلومة الثانية.",
                style: { fontSize: "16px", color: "purple" }
            }
        ],
        details: "هذه تفاصيل إضافية عن المعلومة الثانية."
    },
    {
        number: 19,
        main: [
            {
                text: "هذا هو الفقرة الأولى من المعلومة الثانية.",
                style: { fontSize: "20px", color: "green" }
            },
            {
                text: "هذا هو الفقرة الثانية من المعلومة الثانية.",
                style: { fontSize: "16px", color: "purple" }
            }
        ],
        details: "هذه تفاصيل إضافية عن المعلومة الثانية."
    },
    {
        number: 20,
        main: [
            {
                text: "هذا هو الفقرة الأولى من المعلومة الثانية.",
                style: { fontSize: "20px", color: "green" }
            },
            {
                text: "هذا هو الفقرة الثانية من المعلومة الثانية.",
                style: { fontSize: "16px", color: "purple" }
            }
        ],
        details: "هذه تفاصيل إضافية عن المعلومة الثانية."
    },
    {
        number: 21,
        main: [
            {
                text: "هذا هو الفقرة الأولى من المعلومة الثانية.",
                style: { fontSize: "20px", color: "green" }
            },
            {
                text: "هذا هو الفقرة الثانية من المعلومة الثانية.",
                style: { fontSize: "16px", color: "purple" }
            }
        ],
        details: "هذه تفاصيل إضافية عن المعلومة الثانية."
    },
    {
        number: 22,
        main: [
            {
                text: "هذا هو الفقرة الأولى من المعلومة الثانية.",
                style: { fontSize: "20px", color: "green" }
            },
            {
                text: "هذا هو الفقرة الثانية من المعلومة الثانية.",
                style: { fontSize: "16px", color: "purple" }
            }
        ],
        details: "هذه تفاصيل إضافية عن المعلومة الثانية."
    },
    {
        number: 23,
        main: [
            {
                text: "هذا هو الفقرة الأولى من المعلومة الثانية.",
                style: { fontSize: "20px", color: "green" }
            },
            {
                text: "هذا هو الفقرة الثانية من المعلومة الثانية.",
                style: { fontSize: "16px", color: "purple" }
            }
        ],
        details: "هذه تفاصيل إضافية عن المعلومة الثانية."
    },
    {
        number: 24,
        main: [
            {
                text: "هذا هو الفقرة الأولى من المعلومة الثانية.",
                style: { fontSize: "20px", color: "green" }
            },
            {
                text: "هذا هو الفقرة الثانية من المعلومة الثانية.",
                style: { fontSize: "16px", color: "purple" }
            }
        ],
        details: "هذه تفاصيل إضافية عن المعلومة الثانية."
    },
    {
        number: 25,
        main: [
            {
                text: "هذا هو الفقرة الأولى من المعلومة الثانية.",
                style: { fontSize: "20px", color: "green" }
            },
            {
                text: "هذا هو الفقرة الثانية من المعلومة الثانية.",
                style: { fontSize: "16px", color: "purple" }
            }
        ],
        details: "هذه تفاصيل إضافية عن المعلومة الثانية."
    },
    {
        number: 26,
        main: [
            {
                text: "هذا هو الفقرة الأولى من المعلومة الثانية.",
                style: { fontSize: "20px", color: "green" }
            },
            {
                text: "هذا هو الفقرة الثانية من المعلومة الثانية.",
                style: { fontSize: "16px", color: "purple" }
            }
        ],
        details: "هذه تفاصيل إضافية عن المعلومة الثانية."
    },
    {
        number: 27,
        main: [
            {
                text: "هذا هو الفقرة الأولى من المعلومة الثانية.",
                style: { fontSize: "20px", color: "green" }
            },
            {
                text: "هذا هو الفقرة الثانية من المعلومة الثانية.",
                style: { fontSize: "16px", color: "purple" }
            }
        ],
        details: "هذه تفاصيل إضافية عن المعلومة الثانية."
    },
    {
        number: 28,
        main: [
            {
                text: "هذا هو الفقرة الأولى من المعلومة الثانية.",
                style: { fontSize: "20px", color: "green" }
            },
            {
                text: "هذا هو الفقرة الثانية من المعلومة الثانية.",
                style: { fontSize: "16px", color: "purple" }
            }
        ],
        details: "هذه تفاصيل إضافية عن المعلومة الثانية."
    },
    {
        number: 29,
        main: [
            {
                text: "هذا هو الفقرة الأولى من المعلومة الثانية.",
                style: { fontSize: "20px", color: "green" }
            },
            {
                text: "هذا هو الفقرة الثانية من المعلومة الثانية.",
                style: { fontSize: "16px", color: "purple" }
            }
        ],
        details: "هذه تفاصيل إضافية عن المعلومة الثانية."
    },
    {
        number: 30,
        main: [
            {
                text: "هذا هو الفقرة الأولى من المعلومة الثانية.",
                style: { fontSize: "20px", color: "green" }
            },
            {
                text: "هذا هو الفقرة الثانية من المعلومة الثانية.",
                style: { fontSize: "16px", color: "purple" }
            }
        ],
        details: "هذه تفاصيل إضافية عن المعلومة الثانية."
    },
    {
        number: 31,
        main: [
            {
                text: "هذا هو الفقرة الأولى من المعلومة الثانية.",
                style: { fontSize: "20px", color: "green" }
            },
            {
                text: "هذا هو الفقرة الثانية من المعلومة الثانية.",
                style: { fontSize: "16px", color: "purple" }
            }
        ],
        details: "هذه تفاصيل إضافية عن المعلومة الثانية."
    },
    {
        number: 32,
        main: [
            {
                text: "هذا هو الفقرة الأولى من المعلومة الثانية.",
                style: { fontSize: "20px", color: "green" }
            },
            {
                text: "هذا هو الفقرة الثانية من المعلومة الثانية.",
                style: { fontSize: "16px", color: "purple" }
            }
        ],
        details: "هذه تفاصيل إضافية عن المعلومة الثانية."
    },
    {
        number: 33,
        main: [
            {
                text: "هذا هو الفقرة الأولى من المعلومة الثانية.",
                style: { fontSize: "20px", color: "green" }
            },
            {
                text: "هذا هو الفقرة الثانية من المعلومة الثانية.",
                style: { fontSize: "16px", color: "purple" }
            }
        ],
        details: "هذه تفاصيل إضافية عن المعلومة الثانية."
    },
    {
        number: 34,
        main: [
            {
                text: "هذا هو الفقرة الأولى من المعلومة الثانية.",
                style: { fontSize: "20px", color: "green" }
            },
            {
                text: "هذا هو الفقرة الثانية من المعلومة الثانية.",
                style: { fontSize: "16px", color: "purple" }
            }
        ],
        details: "هذه تفاصيل إضافية عن المعلومة الثانية."
    },
    {
        number: 35,
        main: [
            {
                text: "هذا هو الفقرة الأولى من المعلومة الثانية.",
                style: { fontSize: "20px", color: "green" }
            },
            {
                text: "هذا هو الفقرة الثانية من المعلومة الثانية.",
                style: { fontSize: "16px", color: "purple" }
            }
        ],
        details: "هذه تفاصيل إضافية عن المعلومة الثانية."
    },
    {
        number: 36,
        main: [
            {
                text: "هذا هو الفقرة الأولى من المعلومة الثانية.",
                style: { fontSize: "20px", color: "green" }
            },
            {
                text: "هذا هو الفقرة الثانية من المعلومة الثانية.",
                style: { fontSize: "16px", color: "purple" }
            }
        ],
        details: "هذه تفاصيل إضافية عن المعلومة الثانية."
    },
    {
        number: 37,
        main: [
            {
                text: "هذا هو الفقرة الأولى من المعلومة الثانية.",
                style: { fontSize: "20px", color: "green" }
            },
            {
                text: "هذا هو الفقرة الثانية من المعلومة الثانية.",
                style: { fontSize: "16px", color: "purple" }
            }
        ],
        details: "هذه تفاصيل إضافية عن المعلومة الثانية."
    },
    {
        number: 38,
        main: [
            {
                text: "هذا هو الفقرة الأولى من المعلومة الثانية.",
                style: { fontSize: "20px", color: "green" }
            },
            {
                text: "هذا هو الفقرة الثانية من المعلومة الثانية.",
                style: { fontSize: "16px", color: "purple" }
            }
        ],
        details: "هذه تفاصيل إضافية عن المعلومة الثانية."
    },
    {
        number: 39,
        main: [
            {
                text: "هذا هو الفقرة الأولى من المعلومة الثانية.",
                style: { fontSize: "20px", color: "green" }
            },
            {
                text: "هذا هو الفقرة الثانية من المعلومة الثانية.",
                style: { fontSize: "16px", color: "purple" }
            }
        ],
        details: "هذه تفاصيل إضافية عن المعلومة الثانية."
    },
    {
        number: 40,
        main: [
            {
                text: "هذا هو الفقرة الأولى من المعلومة الثانية.",
                style: { fontSize: "20px", color: "green" }
            },
            {
                text: "هذا هو الفقرة الثانية من المعلومة الثانية.",
                style: { fontSize: "16px", color: "purple" }
            }
        ],
        details: "هذه تفاصيل إضافية عن المعلومة الثانية."
    }
    
];
