const infos = [
    {
        number: 1,
        main: ["عَنْ أَمِيرِ المُؤمِنينَ أَبي حَفْصٍ عُمَرَ بْنِ الخَطَّابِ رَضيَ اللهُ تعالى عنْهُ قَالَ:
               سَمِعْتُ رَسُولَ اللهِ يَقُولُ: إِنَّمَا الأَعْمَالُ بِالنِّيَّاتِ،
               وَإِنَّمَا لِكُلِّ امْرِئٍ مَا نَوَى، فَمَنْ كَانَتْ هِجْرَتُهُ إِلى اللهِ وَرَسُوله فَهِجْرَتُهُ إلى اللهِ وَرَسُوله،
               وَمَنْ كَانَتْ هِجْرَتُهُ لِدُنْيَا يُصِيْبُهَا، أَو امْرأَة يَنْكِحُهَا، فَهِجْرَتُهُ إِلى مَا هَاجَرَ إِلَيْهِ. "
               , 
               "الفقرة الثانية من المعلومة الثانية."],
        details: "تفاصيل إضافية عن المعلومة الأولى."
    },
    {
        number: 2,
        main: ["الفقرة الأولى من المعلومة الثانية.", "الفقرة الثانية من المعلومة الثانية."],
        details: "تفاصيل إضافية عن المعلومة الثانية."
    },
    {
        number: 3,
        main: ["هذه هي الفقرة الأولى من المعلومة.", "وهذه هي الفقرة الثانية من نفس المعلومة."],
        details: "تفاصيل إضافية عن المعلومة الأولى."
    },
    {
        number: 4,
        main: ["هذه هي الفقرة الأولى من المعلومة.", "وهذه هي الفقرة الثانية من نفس المعلومة."],
        details: "تفاصيل إضافية عن المعلومة الأولى."
    },
       {
        number: 5,
        main: ["هذه هي الفقرة الأولى من المعلومة.", "وهذه هي الفقرة الثانية من نفس المعلومة."],
        details: "تفاصيل إضافية عن المعلومة الأولى."
    },
       {
        number: 6,
        main: ["هذه هي الفقرة الأولى من المعلومة.", "وهذه هي الفقرة الثانية من نفس المعلومة."],
        details: "تفاصيل إضافية عن المعلومة الأولى."
    },
       {
        number: 7,
        main: ["هذه هي الفقرة الأولى من المعلومة.", "وهذه هي الفقرة الثانية من نفس المعلومة."],
        details: "تفاصيل إضافية عن المعلومة الأولى."
    },
       {
        number: 8,
        main: ["هذه هي الفقرة الأولى من المعلومة.", "وهذه هي الفقرة الثانية من نفس المعلومة."],
        details: "تفاصيل إضافية عن المعلومة الأولى."
    },
       {
        number: 9,
        main: ["هذه هي الفقرة الأولى من المعلومة.", "وهذه هي الفقرة الثانية من نفس المعلومة."],
        details: "تفاصيل إضافية عن المعلومة الأولى."
    },
       {
        number: 10,
        main: ["هذه هي الفقرة الأولى من المعلومة.", "وهذه هي الفقرة الثانية من نفس المعلومة."],
        details: "تفاصيل إضافية عن المعلومة الأولى."
    },
       {
        number: 11,
        main: ["هذه هي الفقرة الأولى من المعلومة.", "وهذه هي الفقرة الثانية من نفس المعلومة."],
        details: "تفاصيل إضافية عن المعلومة الأولى."
    },
       {
        number: 12,
        main: ["هذه هي الفقرة الأولى من المعلومة.", "وهذه هي الفقرة الثانية من نفس المعلومة."],
        details: "تفاصيل إضافية عن المعلومة الأولى."
    },
       {
        number: 13,
        main: ["هذه هي الفقرة الأولى من المعلومة.", "وهذه هي الفقرة الثانية من نفس المعلومة."],
        details: "تفاصيل إضافية عن المعلومة الأولى."
    },
       {
        number: 14,
        main: ["هذه هي الفقرة الأولى من المعلومة.", "وهذه هي الفقرة الثانية من نفس المعلومة."],
        details: "تفاصيل إضافية عن المعلومة الأولى."
    },
       {
        number: 15,
        main: ["هذه هي الفقرة الأولى من المعلومة.", "وهذه هي الفقرة الثانية من نفس المعلومة."],
        details: "تفاصيل إضافية عن المعلومة الأولى."
    },
       {
        number: 16,
        main: ["هذه هي الفقرة الأولى من المعلومة.", "وهذه هي الفقرة الثانية من نفس المعلومة."],
        details: "تفاصيل إضافية عن المعلومة الأولى."
    },
       {
        number: 17,
        main: ["هذه هي الفقرة الأولى من المعلومة.", "وهذه هي الفقرة الثانية من نفس المعلومة."],
        details: "تفاصيل إضافية عن المعلومة الأولى."
    },
       {
        number: 18,
        main: ["هذه هي الفقرة الأولى من المعلومة.", "وهذه هي الفقرة الثانية من نفس المعلومة."],
        details: "تفاصيل إضافية عن المعلومة الأولى."
    },
       {
        number: 19,
        main: ["هذه هي الفقرة الأولى من المعلومة.", "وهذه هي الفقرة الثانية من نفس المعلومة."],
        details: "تفاصيل إضافية عن المعلومة الأولى."
    },
       {
        number: 20,
        main: ["هذه هي الفقرة الأولى من المعلومة.", "وهذه هي الفقرة الثانية من نفس المعلومة."],
        details: "تفاصيل إضافية عن المعلومة الأولى."
    },
       {
        number: 21,
        main: ["هذه هي الفقرة الأولى من المعلومة.", "وهذه هي الفقرة الثانية من نفس المعلومة."],
        details: "تفاصيل إضافية عن المعلومة الأولى."
    },
       {
        number: 22,
        main: ["هذه هي الفقرة الأولى من المعلومة.", "وهذه هي الفقرة الثانية من نفس المعلومة."],
        details: "تفاصيل إضافية عن المعلومة الأولى."
    },
       {
        number: 23,
        main: ["هذه هي الفقرة الأولى من المعلومة.", "وهذه هي الفقرة الثانية من نفس المعلومة."],
        details: "تفاصيل إضافية عن المعلومة الأولى."
    },
       {
        number: 24,
        main: ["هذه هي الفقرة الأولى من المعلومة.", "وهذه هي الفقرة الثانية من نفس المعلومة."],
        details: "تفاصيل إضافية عن المعلومة الأولى."
    },
       {
        number: 25,
        main: ["هذه هي الفقرة الأولى من المعلومة.", "وهذه هي الفقرة الثانية من نفس المعلومة."],
        details: "تفاصيل إضافية عن المعلومة الأولى."
    },
    {
        number: 26,
        main: ["هذه هي الفقرة الأولى من المعلومة.", "وهذه هي الفقرة الثانية من نفس المعلومة."],
        details: "تفاصيل إضافية عن المعلومة الأولى."
    }
];
