const infos = [
    {
        number: 1,
        main: "الأهرامات من أهم معالم مصر القديمة وتعتبر من عجائب الدنيا السبع.",
        details: "تم بناء الأهرامات كقبور للفراعنة، وأشهرها هرم خوفو في الجيزة."
    },
    {
        number: 2,
        main: "تعد الأهرامات رمزًا للهندسة القديمة والتطور المعماري.",
        details: "يعتقد أن الأهرامات كانت تغطيها طبقة ناعمة من الحجر الجيري اللامع."
    },
    {
        number: 3,
        main: "هرم خوفو هو الأكبر ويبلغ ارتفاعه الأصلي 146.6 متر.",
        details: "تم استخدام أكثر من 2.3 مليون حجر في بناء الهرم الأكبر."
    }
];
